In [ ]:
Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [2]:
import pandas as pd

In [3]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.1)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.5)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.4)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [9]:
s=pd.Series(['4','8','15','16','23','42'])

In [10]:
pd.to_numeric(s)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [11]:
type(s)

pandas.core.series.Series

In [ ]:
Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the 
variable print it.

In [12]:
var=[1,23,4.5,"vishal","rai", "data",345,22,"panda",11]

In [13]:
a=pd.Series(var)

In [15]:
pd.to_numeric(a,errors='ignore')

0         1
1        23
2       4.5
3    vishal
4       rai
5      data
6       345
7        22
8     panda
9        11
dtype: object

In [ ]:
Q3. Create a Pandas DataFrame that contains the following data:
Then, print the DataFrame.
Name      Age          Gender
Alice     25           Female
Bob       30           Male
Claire    27           Female

In [16]:
d={"Name":["Alice","Bob","Claire"],"Age":[25,30,27],"Gender":["Female","Male","Female"]}

In [17]:
df= pd.DataFrame(data=d)

In [18]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [ ]:
Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [ ]:
Answer: In pandas, a DataFrame is a two-dimensional labeled data structure that can hold data in a variety of formats (e.g., NumPy arrays, Python dictionaries, and other DataFrames), with rows and columns that can be labeled and indexed. 
It is a central data structure in pandas and is designed for handling tabular or structured data, similar to a spreadsheet or SQL table.

On the other hand, a pandas Series is a one-dimensional labeled data structure that can hold data of any type (e.g., integers, strings, floats, and Python objects).
It is like a column in a DataFrame, with a label or index for each element in the Series.

In [9]:
import pandas as pd

data = {'make': ['Toyota', 'Honda', 'Ford', 'Tesla'],
        'model': ['Camry', 'Civic', 'F-150', 'Model S'],
        'year': [2018, 2019, 2020, 2021],
        'price': [25000, 22000, 30000, 80000]}

df = pd.DataFrame(data)

In [12]:
df

     make    model  year  price
0  Toyota    Camry  2018  25000
1   Honda    Civic  2019  22000
2    Ford    F-150  2020  30000
3   Tesla  Model S  2021  80000

In [ ]:
We can access each column of the DataFrame as a Series by using the column label as the key. For example, to access the "make" column as a Series, we can do:

In [13]:
make_series = df['make']

In [14]:
make_series

0    Toyota
1     Honda
2      Ford
3     Tesla
Name: make, dtype: object

In [ ]:
Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

In [ ]:
Answer: There are several common functions available in pandas that you can use to manipulate data in a DataFrame:
    1.head() and tail()
    2.drop()
    3.fillna()
    4.merge()
    5.sort_values()

In [ ]:
import pandas as pd

data = {'make': ['Toyota', 'Honda', 'Ford', 'Tesla'],
        'model': ['Camry', 'Civic', 'F-150', 'Model S'],
        'year': [2018, 2019, 2020, 2021],
        'price': [25000, 22000, 30000, 80000]}

df = pd.DataFrame(data)

In [15]:
df

     make    model  year  price
0  Toyota    Camry  2018  25000
1   Honda    Civic  2019  22000
2    Ford    F-150  2020  30000
3   Tesla  Model S  2021  80000

In [16]:
df.head(2)

     make  model  year  price
0  Toyota  Camry  2018  25000
1   Honda  Civic  2019  22000

In [18]:
df.tail(2)

    make    model  year  price
2   Ford    F-150  2020  30000
3  Tesla  Model S  2021  80000

In [19]:
df.drop(columns=['model','year'])

     make  price
0  Toyota  25000
1   Honda  22000
2    Ford  30000
3   Tesla  80000

In [ ]:
Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [ ]:
Answer:  Series and DataFrame are mutable in nature.

In [ ]:
Q7. Create a DataFrame using multiple Series. Explain with an example.

In [ ]:
Answer: To create a DataFrame using multiple Series in pandas, you can use the pd.DataFrame() function and pass in a dictionary where each key is a column name and each value is a Series.

In [21]:
import pandas as pd

name = pd.Series(['Alice', 'Bob', 'Charlie', 'David'])
age = pd.Series([25, 30, 35, 40])
salary = pd.Series([50000, 60000, 70000, 80000])

df1 = pd.DataFrame({'Name': name, 'Age': age, 'Salary': salary})

In [22]:
df1

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000
3    David   40   80000